In [1]:
import pandas as pd

In [2]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

In [3]:
df = pd.DataFrame(ipl_data)

In [4]:
print( df)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

## groupby()

- groupby(x)
- first()
- last()
- nth(x)
- head(x)
- groups
- get_group(x)
- indices

In [10]:
gk_y = df.groupby('Year')

In [11]:
gk_y.first()

        Team  Rank  Points
Year
2014  Riders     1     876
2015  Riders     2     789
2016   Kings     1     756
2017   Kings     1     788

In [93]:
gk_y.last()

        Team  Rank  Points
Year
2014  Royals     4     701
2015  Royals     1     804
2016  Riders     2     694
2017  Riders     2     690

In [96]:
gk_y.nth(0)

        Team  Rank  Points
Year
2014  Riders     1     876
2015  Riders     2     789
2016   Kings     1     756
2017   Kings     1     788

In [94]:
gk_y.nth(1)

        Team  Rank  Points
Year
2014  Devils     2     863
2015  Devils     3     673
2016  Riders     2     694
2017  Riders     2     690

In [95]:
gk_y.nth(2)

       Team  Rank  Points
Year
2014  Kings     3     741
2015  kings     4     812

In [97]:
gk_y.nth(3)

        Team  Rank  Points
Year
2014  Royals     4     701
2015  Royals     1     804

In [98]:
gk_y.nth(4)

Empty DataFrame
Columns: [Team, Rank, Points]
Index: []

In [102]:
gk_y.head(1)

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
6   Kings     1  2016     756
7   Kings     1  2017     788

In [108]:
len(gk_y.head(1))

4

In [103]:
gk_y.head(2)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [109]:
len(gk_y.head(2))

8

In [104]:
gk_y.head(3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [110]:
len(gk_y.head(3))

10

In [107]:
gk_y.head(4)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [111]:
len(gk_y.head(4))

12

In [18]:
gk_y.groups

{2014: [0, 2, 4, 9], 2015: [1, 3, 5, 10], 2016: [6, 8], 2017: [7, 11]}

In [125]:
gk_y.ngroups

4

In [126]:
len(gk_y)

4

In [67]:
gk_y.indices

{2014: array([0, 2, 4, 9], dtype=int64),
 2015: array([ 1,  3,  5, 10], dtype=int64),
 2016: array([6, 8], dtype=int64),
 2017: array([ 7, 11], dtype=int64)}

In [12]:
gk_y.get_group(2014)

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [13]:
gk_y.get_group(2015)

      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804

In [16]:
gk_t = df.groupby('Team')
gk_t.get_group('Kings')

    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788

In [69]:
for name,entries in gk_y:
    print(name)
    print(entries)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [75]:
for name,entries in gk_y:
    print(f'First 2 entries for the "{name}" year:')
    print(36*"-")
    print(entries.head(2),'\n')

First 2 entries for the "2014" year:
------------------------------------
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863

First 2 entries for the "2015" year:
------------------------------------
     Team  Rank  Year  Points
1  Riders     2  2015     789
3  Devils     3  2015     673

First 2 entries for the "2016" year:
------------------------------------
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694

First 2 entries for the "2017" year:
------------------------------------
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

### groupby() 2D

In [116]:
gk_y_2d = df.groupby(['Year','Team'])

In [118]:
gk_y_2d.first()

             Rank  Points
Year Team
2014 Devils     2     863
     Kings      3     741
     Riders     1     876
     Royals     4     701
2015 Devils     3     673
     Riders     2     789
     Royals     1     804
     kings      4     812
2016 Kings      1     756
     Riders     2     694
2017 Kings      1     788
     Riders     2     690

In [119]:
gk_t_2d = df.groupby(['Team','Year'])

In [120]:
gk_t_2d.first()

             Rank  Points
Team   Year
Devils 2014     2     863
       2015     3     673
Kings  2014     3     741
       2016     1     756
       2017     1     788
Riders 2014     1     876
       2015     2     789
       2016     2     694
       2017     2     690
Royals 2014     4     701
       2015     1     804
kings  2015     4     812

In [27]:
gk_3d = df.groupby(['Year','Rank','Team'])

In [28]:
gk_3d.first()

                  Points
Year Rank Team
2014 1    Riders     876
     2    Devils     863
     3    Kings      741
     4    Royals     701
2015 1    Royals     804
     2    Riders     789
     3    Devils     673
     4    kings      812
2016 1    Kings      756
     2    Riders     694
2017 1    Kings      788
     2    Riders     690

### Aggregation

In [31]:
import numpy as np

In [32]:
gk_y['Points'].agg(np.mean)

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [33]:
gk_t['Points'].agg(np.mean)

Team
Devils    768.000000
Kings     761.666667
Riders    762.250000
Royals    752.500000
kings     812.000000
Name: Points, dtype: float64

In [121]:
gk_y_2d.first()

             Rank  Points
Year Team
2014 Devils     2     863
     Kings      3     741
     Riders     1     876
     Royals     4     701
2015 Devils     3     673
     Riders     2     789
     Royals     1     804
     kings      4     812
2016 Kings      1     756
     Riders     2     694
2017 Kings      1     788
     Riders     2     690

In [35]:
gk_y.agg(np.size)

      Team  Rank  Points
Year
2014     4     4       4
2015     4     4       4
2016     2     2       2
2017     2     2       2

In [40]:
gk_t_2d = df.groupby(['Team','Year'])

In [41]:
gk_t_2d.first()

             Rank  Points
Team   Year
Devils 2014     2     863
       2015     3     673
Kings  2014     3     741
       2016     1     756
       2017     1     788
Riders 2014     1     876
       2015     2     789
       2016     2     694
       2017     2     690
Royals 2014     4     701
       2015     1     804
kings  2015     4     812

In [39]:
gk_t.agg(np.size)

        Rank  Year  Points
Team
Devils     2     2       2
Kings      3     3       3
Riders     4     4       4
Royals     2     2       2
kings      1     1       1

In [53]:
gk_t.first(min_count=2)

        Rank    Year  Points
Team
Devils   2.0  2014.0   863.0
Kings    3.0  2014.0   741.0
Riders   1.0  2014.0   876.0
Royals   4.0  2014.0   701.0
kings    NaN     NaN     NaN

In [54]:
gk_t.first(min_count=3)

        Rank    Year  Points
Team
Devils   NaN     NaN     NaN
Kings    3.0  2014.0   741.0
Riders   1.0  2014.0   876.0
Royals   NaN     NaN     NaN
kings    NaN     NaN     NaN

In [55]:
gk_t.first(min_count=4)

        Rank    Year  Points
Team
Devils   NaN     NaN     NaN
Kings    NaN     NaN     NaN
Riders   1.0  2014.0   876.0
Royals   NaN     NaN     NaN
kings    NaN     NaN     NaN

In [45]:
gk_y['Points'].agg([np.sum,np.mean,np.std])

       sum    mean        std
Year
2014  3181  795.25  87.439026
2015  3078  769.50  65.035888
2016  1450  725.00  43.840620
2017  1478  739.00  69.296465

In [56]:
gk_t['Points'].agg([np.sum,np.mean,np.std])

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

In [77]:
gk_y['Points'].sum()

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [78]:
gk_y['Points'].count()

Year
2014    4
2015    4
2016    2
2017    2
Name: Points, dtype: int64

In [79]:
gk_y['Points'].min()

Year
2014    701
2015    673
2016    694
2017    690
Name: Points, dtype: int64

In [80]:
gk_y['Points'].max()

Year
2014    876
2015    812
2016    756
2017    788
Name: Points, dtype: int64

In [81]:
gk_y['Points'].size()

Year
2014    4
2015    4
2016    2
2017    2
Name: Points, dtype: int64

In [82]:
gk_y['Points'].mean()

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [83]:
gk_y['Points'].median()

Year
2014    802.0
2015    796.5
2016    725.0
2017    739.0
Name: Points, dtype: float64

In [85]:
gk_y['Points'].std()

Year
2014    87.439026
2015    65.035888
2016    43.840620
2017    69.296465
Name: Points, dtype: float64

In [86]:
gk_y['Points'].var()

Year
2014    7645.583333
2015    4229.666667
2016    1922.000000
2017    4802.000000
Name: Points, dtype: float64

In [87]:
gk_y['Points'].describe()

      count    mean        std    min    25%    50%     75%    max
Year
2014    4.0  795.25  87.439026  701.0  731.0  802.0  866.25  876.0
2015    4.0  769.50  65.035888  673.0  760.0  796.5  806.00  812.0
2016    2.0  725.00  43.840620  694.0  709.5  725.0  740.50  756.0
2017    2.0  739.00  69.296465  690.0  714.5  739.0  763.50  788.0

In [88]:
gk_y['Points'].nunique()

Year
2014    4
2015    4
2016    2
2017    2
Name: Points, dtype: int64

In [123]:
gk_y[['Rank','Points']].nunique()

      Rank  Points
Year
2014     4       4
2015     4       4
2016     2       2
2017     2       2

In [124]:
gk_y[['Rank','Points']].sum()

      Rank  Points
Year
2014    10    3181
2015    10    3078
2016     3    1450
2017     3    1478

In [91]:
gk_y[['Rank','Points']].agg([np.sum, np.mean,np.std])

     Rank                Points
      sum mean       std    sum    mean        std
Year
2014   10  2.5  1.290994   3181  795.25  87.439026
2015   10  2.5  1.290994   3078  769.50  65.035888
2016    3  1.5  0.707107   1450  725.00  43.840620
2017    3  1.5  0.707107   1478  739.00  69.296465

In [92]:
gk_y.agg({'Rank':[np.sum,np.mean],'Points':np.std})

     Rank          Points
      sum mean        std
Year
2014   10  2.5  87.439026
2015   10  2.5  65.035888
2016    3  1.5  43.840620
2017    3  1.5  69.296465

## transform()

Unlike aggregation methods (and also unlike filtration ones, as we will see soon), transformation methods return a new DataFrame with the same shape and indexing as the original one but with transformed individual values. Here it is important to note that the transformation must not modify any values in the original DataFrame, meaning that such operations cannot be performed in place.

In [128]:
gk_t[['Rank','Points']].transform(lambda x: (x - x.mean())/x.std())

        Rank    Points
0  -1.500000  1.284327
1   0.500000  0.302029
2  -0.707107  0.707107
3   0.707107 -0.707107
4   1.154701 -0.860862
5        NaN       NaN
6  -0.577350 -0.236043
7  -0.577350  1.096905
8   0.500000 -0.770596
9   0.707107 -0.707107
10 -0.707107  0.707107
11  0.500000 -0.815759

## filter()
Filtration methods discard the groups or particular rows from each group based on a predefined condition and return a subset of the original data.

In [129]:
gk_y_2d.first()

             Rank  Points
Year Team
2014 Devils     2     863
     Kings      3     741
     Riders     1     876
     Royals     4     701
2015 Devils     3     673
     Riders     2     789
     Royals     1     804
     kings      4     812
2016 Kings      1     756
     Riders     2     694
2017 Kings      1     788
     Riders     2     690

In [130]:
gk_y['Points'].filter(lambda x: x.mean() > 750)

0     876
1     789
2     863
3     673
4     741
5     812
9     701
10    804
Name: Points, dtype: int64

In [131]:
gk_y['Points'].filter(lambda x: len(x) < 3)

6     756
7     788
8     694
11    690
Name: Points, dtype: int64